Revit 2024 API
DGNImportOptions Class
 The import options used to import DGN format files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class DGNImportOptions : BaseImportOptions
Visual Basic
Public Class DGNImportOptions _
	Inherits BaseImportOptions
Visual C++
public ref class DGNImportOptions : public BaseImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.DGNImportOptions
See Also
DGNImportOptions Members
Autodesk.Revit.DB Namespace